# Phase Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanTopology..::..Phase Property
PlanTopology Class See Also
---
The phase of the PlanTopology.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Phase Phase { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Phase As Phase
	Get
```

Visual C++
---
```text
public:
property Phase^ Phase {
	Phase^ get ();
}
```

# See Also
PlanTopology Class
Autodesk.Revit.DB Namespace